Revit 2027 API
AppearanceAssetEditScope.Commit Method
 Finishes the edit scope.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Commit(
	bool updateOpenViews
)
Public Sub Commit (
	updateOpenViews As Boolean
)
public:
void Commit(
	bool updateOpenViews
)
member Commit :
        updateOpenViews : bool -> unit
Parameters
updateOpenViews Boolean
 When true, force update of the open views.
Exceptions
Exception | Condition
InvalidOperationException |  EditScope is not active. EditScope can only be committed or cancelled when it is active. -or- EditScope cannot be closed, there is no opened transaction. -or- The editable asset is not valid.
Remarks
 All the changes made after starting the EditScope will be committed. Changes will be merged into one transaction. If the appearance asset element is used in one or more materials, they will be updated to match any changes made. Open views may not redraw after changes. View update can be forced with the input argument, but doing so can be an expensive operation. Consider using false if immediate update is not needed or if multiple calls to this method are used in a loop.
See Also
Reference
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace